<script setup lang="ts">


definePageMeta({
  auth: false,
})

</script>
<template>
  <SectionBannersMainIndex />
  <div class="card">
    <img src="" alt="Блюдо">
    <div class="author">Мария Иванова • 2 ч назад</div>
    <div class="text">Сегодня приготовили борщ по бабушкиному рецепту. Всё получилось идеально! Делюсь фото 😊</div>
    <div class="actions">
      <span>❤️ 12</span>
      <span style="cursor:pointer;" onclick="toggleComments(this)">💬 Комментарии</span>
    </div>
    <div class="comments">
      <p><strong>Иван:</strong> Потрясающе! Такой борщ тоже помню от детства</p>
      <p><strong>Ольга:</strong> Рецептом поделитесь?)</p>
    </div>
  </div>
  
  <div class="card">
    <img src="" alt="Блюдо">
    <div class="author">Мария Иванова • 2 ч назад</div>
    <div class="text">Сегодня приготовили борщ по бабушкиному рецепту. Всё получилось идеально! Делюсь фото 😊</div>
    <div class="actions">
      <span>❤️ 12</span>
      <span style="cursor:pointer;" onclick="toggleComments(this)">💬 Комментарии</span>
    </div>
    <div class="comments">
      <p><strong>Иван:</strong> Потрясающе! Такой борщ тоже помню от детства</p>
      <p><strong>Ольга:</strong> Рецептом поделитесь?)</p>
    </div>
  </div>

  <div class="card">
    <img src="" alt="Блюдо">
    <div class="author">Мария Иванова • 2 ч назад</div>
    <div class="text">Сегодня приготовили борщ по бабушкиному рецепту. Всё получилось идеально! Делюсь фото 😊</div>
    <div class="actions">
      <span>❤️ 12</span>
      <span style="cursor:pointer;" onclick="toggleComments(this)">💬 Комментарии</span>
    </div>
    <div class="comments">
      <p><strong>Иван:</strong> Потрясающе! Такой борщ тоже помню от детства</p>
      <p><strong>Ольга:</strong> Рецептом поделитесь?)</p>
    </div>
  </div>

  <div class="card">
    <img src="" alt="Блюдо">
    <div class="author">Мария Иванова • 2 ч назад</div>
    <div class="text">Сегодня приготовили борщ по бабушкиному рецепту. Всё получилось идеально! Делюсь фото 😊</div>
    <div class="actions">
      <span>❤️ 12</span>
      <span style="cursor:pointer;" onclick="toggleComments(this)">💬 Комментарии</span>
    </div>
    <div class="comments">
      <p><strong>Иван:</strong> Потрясающе! Такой борщ тоже помню от детства</p>
      <p><strong>Ольга:</strong> Рецептом поделитесь?)</p>
    </div>
  </div>

  <div class="card">
    <img src="" alt="Блюдо">
    <div class="author">Мария Иванова • 2 ч назад</div>
    <div class="text">Сегодня приготовили борщ по бабушкиному рецепту. Всё получилось идеально! Делюсь фото 😊</div>
    <div class="actions">
      <span>❤️ 12</span>
      <span style="cursor:pointer;" onclick="toggleComments(this)">💬 Комментарии</span>
    </div>
    <div class="comments">
      <p><strong>Иван:</strong> Потрясающе! Такой борщ тоже помню от детства</p>
      <p><strong>Ольга:</strong> Рецептом поделитесь?)</p>
    </div>
  </div>

  <div class="card">
    <img src="" alt="Блюдо">
    <div class="author">Мария Иванова • 2 ч назад</div>
    <div class="text">Сегодня приготовили борщ по бабушкиному рецепту. Всё получилось идеально! Делюсь фото 😊</div>
    <div class="actions">
      <span>❤️ 12</span>
      <span style="cursor:pointer;" onclick="toggleComments(this)">💬 Комментарии</span>
    </div>
    <div class="comments">
      <p><strong>Иван:</strong> Потрясающе! Такой борщ тоже помню от детства</p>
      <p><strong>Ольга:</strong> Рецептом поделитесь?)</p>
    </div>
  </div>
</template>
